{"pageProps":{"post":{"title":"Building your BFF with GraphQL","excerpt":"Following the microservice architecture, we often have multiple API services and the developers need to ad-hoc integrate with them. This post is about using GraphQL to create a backend for front end as a unified aggregation layer at the edge.","coverImage":"/images/jason-rosewell-ASKeuOZqhYU.jpg","date":"2020-10-15T06:25:07.322Z","content":"<p>As a front-end developer, I love to focus on UI/UX and what the users see is a single monolithic product and they might not want to know about underlying APIs. Back-end developers often want to decouple the API layer. To achieve the dual goal, we can rely on GraphQL to build up a backend for the front end as an extra layer to consolidate and aggregate data from these API services and delivery to the front end side as a single endpoint.</p>\n<p>Following the definition of BFF by Sam Newman and associates, the BFF is tightly coupled to a specific user experience and needs to aggregate multiple downstream calls to deliver user functionalities. Not to say nothing of we often have various clients such as web browser, mobile browser, iOS/Android application.</p>\n<h2>Why GraphQL?</h2>\n<p>GraphQL is a query language for APIs and a runtime for fulfilling those queries with your existing data. GraphQL provides a complete and understandable description of the data in your API, gives clients the power to ask for exactly what they need and nothing more, makes it easier to evolve APIs over time, and enables powerful developer tools.</p>\n<h3>Query for what you need</h3>\n<p>Each client has different perspectives about data shape, for example: getting user details (basic information, addresses, contacts…), the mobile version might have options to click to navigate to view the list of addresses or contacts, but in the web version with larger display area, it might display everything.</p>\n<h3>Multiple queries at once request</h3>\n<p>Sometimes we need to make multiple API calls and will choose to fetch the data sequentially or parallelly, more logic and round trips added. With GraphQL you can make many requests at once.</p>\n<h3>Static type generation</h3>\n<p>We can not avoid the benefit of static type when developing the application, that's why TypeScript has been increasing in its popularity for the last couple of years. Some tools offer TypeScript definition code generation from the GraphQL queries <a href=\"https://www.graphql-code-generator.com/\" title=\"GraphQL Code Generator\">GraphQL Code Generator</a> or <a href=\"https://github.com/apollographql/apollo-tooling\" title=\"Apollo Codegen\">Apollo Codegen</a>.</p>\n<h3>Single source of truth for clients</h3>\n<p>We can choose to define all GraphQL schema before developing, the backend side could rely on the schema definition to develop, and the front end side can trust the data shape. Later when something needs to be changed from the other services, we have a less painful choice to patch the update.</p>\n<h3>Rapid prototype development</h3>\n<p>GraphQL has a single endpoint and the client can decide which data to get. We can think it's like using raw queries to access the server database.</p>\n<h3>Self-documented</h3>\n<p>To build up a GraphQL service, we need to create the schema for everything from model definition to resolvers. As the schema is tightly coupled with the development code we will naturally update the docs.</p>\n<h2>GraphQL drawbacks</h2>\n<p>Since GraphQL has only one endpoint, it's nearly impossible to rely on HTTP cache control as well as route-based authorization rules.</p>\n<p>Almost all people can point out that using a single endpoint will lead to a bottleneck and we have to spend time to scale and maintain the availability for that. Luckily we can learn from <a href=\"https://netflixtechblog.com/how-netflix-scales-its-api-with-graphql-federation-part-1-ae3557c187e2\" title=\"how Netflix scales its API with GraphQL federation\">how Netflix scales its API with GraphQL federation</a>.</p>\n<p>When applying GraphQL, people tend to migrate all other Restful APIs to GraphQL because using both of them feels weird for the perfectionist. Consequently, it always takes an extra workload for the development process.</p>\n<p>When using GraphQL especially Apollo GraphQL, the client-side often comes with Apollo Client and it makes your client setup is more cumbersome.</p>\n<p>A well-known problem when people explore GraphQL is N+1 queries, it's the same as the ORM problem. Of course, we might hear about DataLoader as a data fetching layer to reduce requests by batching and caching but to me, I'd prefer to do an eager query.</p>\n","slug":"building-your-bff-with-graphql"}},"__N_SSG":true}