{"pageProps":{"post":{"title":"Client-to-microservice communication strategy in a nutshell","excerpt":"In recent years, microservice architecture has been becoming popular and being widely adopted by many various companies. The outcome often comes with several API services. In most cases, the client-side should be the one to aggregate data from different API services to deliver a seamless experience to the end-user.","coverImage":"/images/jason-rosewell-ASKeuOZqhYU.jpg","date":"2020-09-12T05:35:07.322Z","content":"<p>In recent years, microservice architecture has been becoming popular and being widely adopted by many various companies. The outcome often comes with several API services. In most cases, the client-side should be the one to aggregate data from different API services to deliver a seamless experience to the end-user.</p>\n<p>Before digging in, I would scope the terms using in this post:</p>\n<ul>\n<li>Client — A client may be a SPA website, a server sider rending website, a mobile application, an IoT device, or other integration services… but we will focus on web and mobile applications.</li>\n<li>Web service APIs — There are SOAP, RPC (JSON-RPC, XML RPC, gRPC), REST.</li>\n<li>Realtime APIs techniques — There are HTTP Long polling, Websocket, WebRTC, MQTT…</li>\n<li>Web rendering techniques — Client-side rendering (initialize with HTML and CSS then the content comes from Javascript), Server-side rendering (server responses an HTML string), Universal rendering (combine the best of both client-side rendering and server-side rendering)</li>\n</ul>\n<p>Choosing the technique to integrate clients and servers to use depends on the context of the application and these use cases. As a front end developer, we usually concern about:</p>\n<ul>\n<li>Service API endpoint: This will be the first question then are there multiple API endpoints or a single API endpoint?</li>\n<li>Authentication: Cookies or JWT Bearer token?</li>\n<li>Protocol: REST, RPC or do we need to support realtime with WebSocket or Long Polling?</li>\n<li>Response data: What is the data interchange format is using? JSON or XML, gRPC? What about metadata conversion? Is the key field in the camel or snake case? What about data normalization?</li>\n<li>Data synchronization: How we consolidate data from the server with client data?</li>\n<li>Cooking data: when dealing with multiple data sources, we will need to compute derived data, but should that task is in server or client?</li>\n</ul>\n<p>In a microservice architecture, the communication between services is also the most important factor, and they may use different effective protocols, data formats and that maybe not friendly with web front end developer (gRPC for example) but to support the client, they might need to expose extra HTTP Restful endpoint. Each microservice exposes a set of fine-grained endpoints and this can impact client-to-microservice communication.</p>\n<p>To easier catch up the problem, let’s imagine that we are developing a shopping application (I would get the example from <a href=\"https://www.nginx.com/blog/building-microservices-using-an-api-gateway/#product-details-scenario\" title=\"this blog post\">this blog post</a>) and it’s likely that you need to implement a product details page.</p>\n<p><a href=\"https://cdn.wp.nginx.com/wp-content/uploads/2016/04/Richardson-microservices-part2-1_amazon-apps.png\" title=\"Amazon’s Android mobile application.\"><img src=\"https://cdn.wp.nginx.com/wp-content/uploads/2016/04/Richardson-microservices-part2-1_amazon-apps.png\" alt=\"Amazon’s Android mobile application.\"></a></p>\n<p>This page does not only show the basic information such as name, description, price, but it may also show:</p>\n<ul>\n<li>Shopping cart items</li>\n<li>Order history</li>\n<li>Customer reviews</li>\n<li>Inventory status</li>\n<li>Shipping options</li>\n<li>Promotion information</li>\n<li>Product recommendation</li>\n<li>…</li>\n</ul>\n<p>To have data to display this page in the microservice, the client has to communicate with:</p>\n<ul>\n<li>Shopping cart service — to get the information about a user cart, it is not all about the cart items, it may need just a number of items in the cart</li>\n<li>Order service — to display the brief of order information, it may need just the last order time</li>\n<li>Inventory service — to display the inventory status, but it also needs just the number of remaining items or it may ask the policy service to display the buying tag, such as: Out of stock or Contact or Available in different locations…</li>\n<li>Shipping service — to display the information about the shipping option, it is also not everything in the shipping entity response.</li>\n<li>Realtime promotion service — when you see the customer stays in this product too long and you want to encourage her to buy, a promotion may be distributed…</li>\n<li>…</li>\n</ul>\n<p>I guess you may think in mind: Oh, just a simple page consumes data from so many data sources (API services) or the number of items in the cart is just a number, does it necessary to get the whole cart data? Will the cart service expose an endpoint just for returning the number of items in the cart? When we want to personalize data by some factors like a user gender, location, or age range…it is so messed up.</p>\n<p>Now, it is enough background to get in, let’s look at 2 popular options.</p>\n<h2>Direct client-to-microservice communication</h2>\n<p>A client app can make requests directly to some of the microservices.</p>\n<p><a href=\"https://docs.microsoft.com/en-us/dotnet/architecture/microservices/architect-microservice-container-applications/media/direct-client-to-microservice-communication.png\" title=\"Using a direct client-to-microservice communication architecture\"><img src=\"https://docs.microsoft.com/en-us/dotnet/architecture/microservices/architect-microservice-container-applications/media/direct-client-to-microservice-communication.png\" alt=\"Using a direct client-to-microservice communication architecture\"></a></p>\n<p>This communication architecture could be good enough for a small microservice-based application. However, when you build large and complex applications as the example above, that approach faces a few issues.</p>\n<p>Consider the following questions/issues when developing a large application based on microservices:</p>\n<ul>\n<li>How can client apps minimize the number of network requests to the backend and reduce chatty communication to multiple services?</li>\n<li>What do we do when we need data from multiple dependant services?</li>\n<li>How can client apps communicate with services that use non-Internet-friendly protocol?</li>\n<li>The front end developers need to know multiple areas of the application are decomposed in microservices.</li>\n<li>Too many round trips can result in multiple network round trips between the client and the server, adding significant latency.</li>\n<li>Security issues also need to be a concern because all the microservices must be exposed to the ‘external world’, making the attack surface larger.</li>\n</ul>\n<h2>API Gateway</h2>\n<h3>Single API Gateway</h3>\n<p>This is a service that provides a single-entry point for certain groups of microservices. It’s similar to the <a href=\"https://en.wikipedia.org/wiki/Facade_pattern\">Facade pattern</a> from object-oriented design, but in this case, it’s part of a distributed system.</p>\n<p>Therefore, the API gateway sits between the client and the microservices, it plays as a reverse proxy, routing requests to services and can also provide additional cross-cutting features such as authentication and cache.</p>\n<p><a href=\"https://docs.microsoft.com/en-us/dotnet/architecture/microservices/architect-microservice-container-applications/media/direct-client-to-microservice-communication-versus-the-api-gateway-pattern/custom-service-api-gateway.png\" title=\"Using a custom API Gateway service\"><img src=\"https://docs.microsoft.com/en-us/dotnet/architecture/microservices/architect-microservice-container-applications/media/direct-client-to-microservice-communication-versus-the-api-gateway-pattern/custom-service-api-gateway.png\" alt=\"Using a custom API Gateway service\"></a></p>\n<p>This API gateway will be growing and maybe bloated and could be similar to a monolithic service.</p>\n<h3>Multiple API Gateways</h3>\n<p>API Gateways should be segregated based on business boundaries. Or we can choose to develop a different API Gateway for different clients (mobile or web). In this case, we have a pattern “Backend for Frontend” (<a href=\"https://samnewman.io/patterns/architectural/bff/\">BFF</a>) where each API Gateway can provide a different API tailored for each client.</p>\n<p><a href=\"https://docs.microsoft.com/en-us/dotnet/architecture/microservices/architect-microservice-container-applications/media/direct-client-to-microservice-communication-versus-the-api-gateway-pattern/multiple-custom-api-gateways.png\" title=\"Using multiple custom API Gateways\"><img src=\"https://docs.microsoft.com/en-us/dotnet/architecture/microservices/architect-microservice-container-applications/media/direct-client-to-microservice-communication-versus-the-api-gateway-pattern/multiple-custom-api-gateways.png\" alt=\"Using multiple custom API Gateways\"></a></p>\n<p>At Netflix, they have also adopted this pattern: the Backend for Frontend pattern per client (Android, iOS, TV, Web).</p>\n<h3>API Gateway drawbacks</h3>\n<ul>\n<li>Creating an additional possible single point of failure</li>\n<li>If not scaled out properly, the API gateway can become a bottleneck</li>\n<li>Requiring additional development cost and future maintenance</li>\n<li>It will slow down the team development if we do not prepare the adoption plan carefully</li>\n</ul>\n<p>Everything comes with pros and cons, especially choosing things not as simple as comparing the number of pros and cons, following the trend, or seeing others do that. To me, I tend to follow the core principle or the concept of how it works. Then I will choose if it matches the spirit or the strategic direction.</p>\n<p><strong>Direct client-to-microservice communication</strong> — front-end developers need to spread tasks for API data integration from multiple services and developing UI/UX. This way is appropriate when the team skill is comprehensive, good in both data manipulation and aesthetic ability.</p>\n<p><strong>API gateway</strong> is centralized management, API gateway has the ability to focus on what it does with a huge of supporting tools, the result is front end developers can focus on developing better UI/UX for end-user without requiring time for the complexity of data integration. This way is appropriate when we have a specialized team.</p>\n<p>Next post I will write about using GraphQL to implement the BFF pattern. I choose GraphQL because the concept is very simple: instead of having multiple “dumb” endpoints, have a single “smart” endpoint that can take in complex queries, and then massage the data output into whatever shape the client requires.</p>\n<h2>References</h2>\n<p><a href=\"https://docs.microsoft.com/en-us/dotnet/architecture/microservices/\">.NET Microservices — Architecture e-book</a>: I use this resource for the concept and the standard term.</p>\n<p><a href=\"https://www.nginx.com/blog/building-microservices-using-an-api-gateway/\">Building Microservices: Using an API Gateway</a>: I follow this series to understand Microservice.</p>\n<p><a href=\"https://www.researchgate.net/publication/319187656_Processes_Motivations_and_Issues_for_Migrating_to_Microservices_Architectures_An_Empirical_Investigation\">Processes, Motivations, and Issues for Migrating to Microservices Architectures: An Empirical Investigation</a>: I refer to this paper for the numbers, statistics, of these researchers to avoid opinionated thinking.</p>\n<p><a href=\"https://medium.com/walmartglobaltech/building-a-decoupled-architecture-to-optimize-our-mobile-apps-7bc4a0d6da37\">Building a Decoupled Architecture to Optimize our Mobile Apps</a>: From\nWalmart, I can learn the cost of having a legacy architecture.</p>\n<p><a href=\"https://simplicable.com/new/smart-endpoints-and-dumb-pipes\">Smart endpoints and dumb pipes design principle</a></p>\n","slug":"client-to-microservice-communication-strategy-in-a-nutshell"}},"__N_SSG":true}